manycell-core/mssimulator/copasiwsclient/copasiws/binding.deleteSimulationResource.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns2="http://timecoursews.services.copasiws.copasi.org/types"
 xmlns:ns1="http://services.copasiws.copasi.org/timecoursews.wsdl"
 xmlns:ns3="http://copasi.org/copasiws/schemas">
 <SOAP-ENV:Body>
   <ns3:DeleteSimulationResource>
    <ns3:userId></ns3:userId>
    <ns3:resourceId>0</ns3:resourceId>
   </ns3:DeleteSimulationResource>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
